# Test data
Several test inputs and two test functions are inside [Main.hs](src/Main.hs).

## Examples of use
```haskell
*Main> test10
>> string2occurrence "Haskell"
<< [('H',1),('a',1),('e',1),('k',1),('s',1),('l',2)]

>> occurrence2tree "[('H',1),('a',1),('e',1),('k',1),('s',1),('l',2)]"
<< Node 7 (Node 3 (Leaf 's' 1) (Leaf 'l' 2)) (Node 4 (Node 2 (Leaf 'H' 1) (Leaf 'a' 1)) (Node 2 (Leaf 'e' 1) (Leaf 'k' 1)))

>> tree2assoc "[('H',1),('a',1),('e',1),('k',1),('s',1),('l',2)]"
<< [('s',[0,0]),('l',[0,1]),('H',[1,0,0]),('a',[1,0,1]),('e',[1,1,0]),('k',[1,1,1])]

>> assoc2code "[('s',[0,0]),('l',[0,1]),('H',[1,0,0]),('a',[1,0,1]),('e',[1,1,0]),('k',[1,1,1])]"
<< [1,0,0,1,0,1,0,0,1,1,1,1,1,0,0,1,0,1]

>> decode ([1,0,0,1,0,1,0,0,1,1,1,1,1,0,0,1,0,1], [('s',[0,0]),('l',[0,1]),('H',[1,0,0]),('a',[1,0,1]),('e',[1,1,0]),('k',[1,1,1])])
<< Haskell
```

```haskell
*Main> demo1 "Prolog"
>> encode "Prolog"
<< ([1,1,0,0,1,1,0,0,0,1,0,1,1,1],[('l',[0,0]),('r',[0,1]),('o',[1,0]),('P',[1,1,0]),('g',[1,1,1])])

>> decode ([1,1,0,0,1,1,0,0,0,1,0,1,1,1],[('l',[0,0]),('r',[0,1]),('o',[1,0]),('P',[1,1,0]),('g',[1,1,1])])
<< Prolog
```
